ThomHPL/ESP32-BLE-CustomGamepad/BleCustomGamepad.cpp
  NimBLECharacteristic* pCharacteristic_Power_State = BleCustomGamepadInstance->hid->getBatteryService()->createCharacteristic(
        CHARACTERISTIC_UUID_BATTERY_POWER_STATE,
        NIMBLE_PROPERTY::READ | NIMBLE_PROPERTY::NOTIFY
      );
  BleCustomGamepadInstance->pCharacteristic_Power_State = pCharacteristic_Power_State; // Assign the created characteristic
  BleCustomGamepadInstance->pCharacteristic_Power_State->setValue(0b00000000); // Now it's safe to call setValue <- Set all to unknown by default

  BleCustomGamepadInstance->hid->setPnp(0x01, BleCustomGamepadInstance->configuration.getVid(), BleCustomGamepadInstance->configuration.getPid(), BleCustomGamepadInstance->configuration.getGuidVersion());
  BleCustomGamepadInstance->hid->setHidInfo(0x00, 0x01);

  // NimBLEDevice::setSecurityAuth(BLE_SM_PAIR_AUTHREQ_BOND);
  NimBLEDevice::setSecurityAuth(true, false, false); // enable bonding, no MITM, no SC


  uint8_t customHidReportDescriptor[BleCustomGamepadInstance->hidReportDescriptorSize];
  memcpy(customHidReportDescriptor, BleCustomGamepadInstance->tempHidReportDescriptor, BleCustomGamepadInstance->hidReportDescriptorSize);

  // // Testing - Ask ChatGPT to convert it into a commented HID descriptor
  // Serial.println("------- HID DESCRIPTOR START -------");
  // for (int i = 0; i < BleCustomGamepadInstance->hidReportDescriptorSize; i++)
  // {
  //    Serial.printf("%02x", customHidReportDescriptor[i]);
  //    Serial.println();
  // }
  // Serial.println("------- HID DESCRIPTOR END -------");
  
  BleCustomGamepadInstance->hid->setReportMap((uint8_t *)customHidReportDescriptor, BleCustomGamepadInstance->hidReportDescriptorSize);
  BleCustomGamepadInstance->hid->startServices();

  BleCustomGamepadInstance->onStarted(pServer);

  NimBLEAdvertising *pAdvertising = pServer->getAdvertising();
  pAdvertising->setAppearance(HID_GAMEPAD);
  pAdvertising->setName(BleCustomGamepadInstance->deviceName);
  pAdvertising->addServiceUUID(BleCustomGamepadInstance->hid->getHidService()->getUUID());
  
  if(BleCustomGamepadInstance->delayAdvertising)
  {
    NIMBLE_LOGD(LOG_TAG, "Main NimBLE server advertising delayed (until Nordic UART Service added)");
  }
  else
  {
    NIMBLE_LOGD(LOG_TAG, "Main NimBLE server advertising started!");
    pAdvertising->start();
  }
  
  BleCustomGamepadInstance->hid->setBatteryLevel(BleCustomGamepadInstance->batteryLevel);

  vTaskDelay(portMAX_DELAY); // delay(portMAX_DELAY);
}